ДИПЛОМНЕТОЛОГИЯ/src/Documents/ВКМ_УстановкаОкладовИПроцентов/ВКМ_УстановкаОкладовИПроцентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_УстановкаОкладовИПроцентов</name>
  <registerRecords>InformationRegister.ВКМ_УсловияОплатыСотрудников</registerRecords>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентЗаВыполненныеРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

ДИПЛОМНЕТОЛОГИЯ/src/InformationRegisters/ВКМ_УсловияОплатыСотрудников/ВКМ_УсловияОплатыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_УсловияОплатыСотрудников</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентЗаВыполненныеРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ДИПЛОМНЕТОЛОГИЯ/src/Documents/ВКМ_УстановкаОкладовИПроцентов/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)  

	// регистр ВКМ_ОкладыИПроценты
	Движения.ВКМ_УсловияОплатыСотрудников.Записывать = Истина;
	Движение = Движения.ВКМ_УсловияОплатыСотрудников.Добавить(); 
	Движение.Период = Дата;
	Движение.Сотрудник = Сотрудник;
	Движение.Оклад = Оклад;
	Движение.ПроцентЗаВыполненныеРаботы = ПроцентЗаВыполненныеРаботы;

КонецПроцедуры
